


# 将输入的数字 进行运算后 与校验码核对 最终输出全部号码
    # 输入阶段：
    # 运算阶段：
    # 校验阶段：
    # 输出阶段：



################################################################################################

# 0输入阶段：

# 输入数字（字符串）
YSZ=input()

# 将输入的字符串转换为列表
ZHlist = list(YSZ)

# 给JG用于输出结果
JG = ZHlist

# 将字符串列表转换为数字列表供ai运算
ai = list(map(int, ZHlist))



################################################################################################

# 1运算阶段：

# i [序号] 常量 包括校验码在内 从右至左的序号
# xuhao = [18,17,16,15,14,13,12,11,10,9,8,7,6,5,4,3,2,1]

# ai 变量 该序号上的数字
# ai = [3,7,0,2,0,2,1,9,9,7,0,4,0,9,2,6,1]

# wi 常量 具体为2的[序号]次方 与11相除的余数
wi = [7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2]

temp2 = [a*b for a, b in zip(ai,wi)]
# ai和wi相乘

S = sum(temp2)
# S最终等于第十八位至第一位的ai*wi的积的和(temp)

Y=S % 11
# Y 是一个变量 是S与11相除的余数
# Y=mod(S,11)

# 最终得出Y 可以与校验码对比

################################################################################################

# 2校验阶段：

# 校验码 与Y对应 是一个常量
# 校验码中第H个元素与Y相等 输出H
# 输出与对应校验码中第H个元素
# 就是最终判断得出的校验码
# JYM = [0,1,2,3,4,5,6,7,8,9,10]
DYJYM = ['1','0','X','9','8','7','6','5','4','3','2']
# 3+1=4 找寻DYJYM中第4个元素 输出
# JG.append(DYJYM[Y])


################################################################################################

# 3输出阶段：

# 最后增加在结果里
# JG.append(最终判断得出的校验码)
JG.append(DYJYM[Y])
# print(DYJYM[Y])s
# 将JG列表中的元素拼接成一个字符串
SCJG = ''.join(JG)
# 最终输出
print(SCJG)
input()

# 输出字符串结果 成功